# основа для нашего image
FROM node

# рабочая директория нашего приложения
WORKDIR /app

# задействываем кеш композера
COPY package.json .

# подготовка к запуску приложения в момент сборки образа (уже из кеша)
RUN npm install

# копирование файлов внутрь image относительно WORKDIR
COPY . .

# задаём переменные окружения - будет передано внутрь контейнера
ENV PORT 80

# какой порт использует наше приложение (уже забираем из переменной окружения)
EXPOSE $port

VOLUME ["/app/data"]

# непосредственная команда при запуске образа
CMD ["node", "app.js"]
